alefragnani.project-manager
aliasadidev.nugetpackagemanagergui
anthropic.claude-code
anweber.vscode-httpyac
azurite.azurite
cspotcode.github-enterprise-credentials-provider
davidanson.vscode-markdownlint
editorconfig.editorconfig
formulahendry.dotnet-test-explorer
github.copilot-chat
golang.go
gruntfuggly.todo-tree
johnpapa.vscode-peacock
josefpihrt-vscode.roslynator
kreativ-software.csharpextensions
ms-azure-load-testing.microsoft-testing
ms-azuretools.azure-dev
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurecontainerapps
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-containers
ms-azuretools.vscode-cosmosdb
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.vscode-node-azure-pack
ms-windows-ai-studio.windows-ai-studio
pkief.material-icon-theme
teamsdevapp.vscode-ai-foundry
usernamehw.errorlens
zhuangtongfa.material-theme
